# 데이터프레임 합성

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [3]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [5]:
# Inner join            A n B                   Left outer join A-B / right outer join B-A  /   Full outer join AUB
pd.merge(df1, df2)      # how = 'inner'

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [7]:
# Left outer join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [10]:
# Right outer join
pd.merge(df1, df2, how='right')     # db에 따라서 left만 지원하는 경우도 있음. 그럴 경우 바꿔서 진행

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [11]:
# Full outer join
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [12]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [13]:
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

## join 메서드

In [22]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1.set_index('고객번호', inplace=True)
df1

       이름
고객번호
1001   둘리
1002  도우너
1003   또치
1004   길동
1005   희동
1006  마이콜
1007   영희

In [25]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2.set_index('고객번호', inplace=True)
df2

          금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1008  100000
1001   30000

In [27]:
df1.join(df2, how='inner')          # join을 쓰려면 키값이 같아야함

       이름     금액
고객번호
1001   둘리  10000
1001   둘리  20000
1001   둘리  30000
1005   희동  15000
1006  마이콜   5000

## concat 함수

In [28]:
s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])

In [29]:
s1

A    0
B    1
dtype: int64

In [30]:
s2

A    2
B    3
C    4
dtype: int64

In [31]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [32]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [33]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [34]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

````연습 문제 2

어느 회사의 전반기(1월 ~ 6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타내는 데이터프레임을 만든 뒤 합친다. 실적 정보는 “매출”, “비용”, “이익” 으로 이루어진다. (이익 = 매출 - 비용).

또한 1년간의 총 실적을 마지막 행으로 덧붙인다.````

In [38]:
df1 = pd.DataFrame(np.random.randint(100, 1000, size=(6,3)),
                   columns=['매출','비용','이익'],
                   index=['1월','2월','3월','4월','5월','6월'])
df1

     매출   비용   이익
1월  933  372  661
2월  400  553  853
3월  483  836  186
4월  955  139  665
5월  529  429  890
6월  109  256  113

In [39]:
df2 = pd.DataFrame(np.random.randint(100, 1000, size=(6,3)),
                   columns=['매출','비용','이익'],
                   index=['7월','8월','9월','10월','11월','12월'])
df2

      매출   비용   이익
7월   475  280  921
8월   822  507  823
9월   716  277  256
10월  212  900  690
11월  691  743  728
12월  345  194  900

In [41]:
df = pd.concat([df1, df2])
df

      매출   비용   이익
1월   933  372  661
2월   400  553  853
3월   483  836  186
4월   955  139  665
5월   529  429  890
6월   109  256  113
7월   475  280  921
8월   822  507  823
9월   716  277  256
10월  212  900  690
11월  691  743  728
12월  345  194  900

In [43]:
tdf = pd.DataFrame(df.sum()).T
tdf

     매출    비용    이익
0  6670  5486  7686

In [44]:
tdf.index = ['합계']
tdf

      매출    비용    이익
합계  6670  5486  7686

In [45]:
df = pd.concat([df, tdf])
df

       매출    비용    이익
1월    933   372   661
2월    400   553   853
3월    483   836   186
4월    955   139   665
5월    529   429   890
6월    109   256   113
7월    475   280   921
8월    822   507   823
9월    716   277   256
10월   212   900   690
11월   691   743   728
12월   345   194   900
합계   6670  5486  7686